driver-tests/bpelse/assign/AssignJbi/test/results/QueryWithNamespace1/Actual_20130314144903_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <person xmlns="http://sun.com/bpel/QueryWithNamespace1Wsdl" xmlns:msgns="http://sun.com/bpel/QueryWithNamespace1Wsdl">
      <name>David Mathews</name>
      <address>
        <street xmlns:s1="http://sun.com/bpel/QueryWithNamespace1Wsdl" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">1 Atlantic St</street>
        <city>Arcadia</city>
        <state>CA</state>
        <zip>91007</zip>
      </address>
    </person>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>