driver-tests/bpelse/nmproperty/SOAPHeaderCA/test/AccessSOAPHeader/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <person xmlns:msgns="http://j2ee.netbeans.org/wsdl/accessSOAPHeader/accessSOAPHeader" xmlns:per="http://localhost/person" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://localhost/person" name="John Doe">
      <per:birthdate>
        <per:month>Aug</per:month>
        <per:day>16</per:day>
        <per:year>2008</per:year>
      </per:birthdate>
      <per:home country="US">
        <per:name>John Doe</per:name>
        <per:street>1000 Commerce Drive</per:street>
        <per:city>Pittsburgh</per:city>
        <per:state>PA</per:state>
        <per:zip>11520</per:zip>
        <per:note>header</per:note>
      </per:home>
      <per:work country="US">
        <per:name>John Doe</per:name>
        <per:street>Street1</per:street>
        <per:city>Arcadia</per:city>
        <per:state>CA</per:state>
        <per:zip>91007</per:zip>
      </per:work>
    </person>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
