driver-tests/bpelse/assign/TypeHierarchyCA/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:per="http://localhost/person" xmlns:add="http://xml.netbeans.org/examples/AddressNS">
  <soapenv:Body>
    <per:person>
      <per:firstName>John</per:firstName>
      <per:lastName>Doe</per:lastName>
      <per:address>
        <add:name>John Doe</add:name>
        <add:street>800 Royal Oaks</add:street>
      </per:address>
    </per:person>
  </soapenv:Body>
</soapenv:Envelope>