driver-tests/bpelse/assign/AssignJbi/test/QueryWithNamespace1/Output.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><person xmlns="http://sun.com/bpel/QueryWithNamespace1Wsdl"><ns1:name xmlns:ns1="http://sun.com/bpel/QueryWithNamespace1Wsdl">David Mathews</ns1:name><ns1:address xmlns:ns1="http://sun.com/bpel/QueryWithNamespace1Wsdl"><ns1:street>1 Atlantic St</ns1:street><ns1:city>Arcadia</ns1:city><ns1:state>CA</ns1:state><ns1:zip>91007</ns1:zip></ns1:address></person></SOAP-ENV:Body></SOAP-ENV:Envelope>