driver-tests/bpelse/assign/TypeHierarchyCA/test/TestCase1/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <ns1:person xmlns:msgns="http://j2ee.netbeans.org/wsdl/TypeHierarchy/BPTypeHierarchy" 
        xmlns:ns0="http://xml.netbeans.org/examples/EmployeeNS" 
        xmlns:ns1="http://localhost/person" 
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
        xsi:type="ns0:EmployeeType">
      <ns1:firstName>John</ns1:firstName>
      <ns1:lastName>Doe</ns1:lastName>
      <ns1:address xmlns:ns2="http://xml.netbeans.org/examples/AddressNS" xsi:type="ns2:USAddressType">
        <ns2:name>John Doe</ns2:name>
        <ns2:street>800 Royal Oaks</ns2:street>
        <ns2:city>Monrovia</ns2:city>
        <ns2:state>CA</ns2:state>
        <ns2:zip>91016</ns2:zip>
        <ns2:note>EmpId is 100</ns2:note>
      </ns1:address>
      <ns0:department>Development</ns0:department>
      <ns0:empId>100</ns0:empId>
    </ns1:person>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
