driver-tests/bpelse/assign/AssignJbi/test/QueryWithNamespace1/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                    xmlns:s1="http://sun.com/bpel/QueryWithNamespace1Wsdl">
  <soapenv:Body>
    <s1:person>
        <s1:name>David Mathews</s1:name>
        <s1:address>
            <s1:street>1 Atlantic St</s1:street>
            <s1:city>Arcadia</s1:city>
            <s1:state>CA</s1:state>
            <s1:zip>91007</s1:zip>
        </s1:address>        
    </s1:person>
  </soapenv:Body>
</soapenv:Envelope>